Revit 2027 API
FormulaEditingEventArgs.CurrentDocument Property
 Returns the current document
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document CurrentDocument { get; }
Public ReadOnly Property CurrentDocument As Document
	Get
public:
property Document^ CurrentDocument {
	Document^ get ();
}
member CurrentDocument : Document with get
Property Value
Document
See Also
Reference
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace